#include <iostream>
using namespace std;

// ----------------------------------------------------------------------- 1: перевірка на щасливе число --------------------------------------------------------------------------------- //
void luckyNum() {
    int num;
    cout << "введіть шестизначне число: ";
    cin >> num;

    if (num < 100000 || num > 999999) {
        cout << "помилка! введене число не є шестизначним :(" << endl;
        return;
    }

    int sum1 = (num / 100000) + (num / 10000 % 10) + (num / 1000 % 10);
    int sum2 = (num / 100 % 10) + (num / 10 % 10) + (num % 10);

    if (sum1 == sum2)
        cout << "число щасливе! :D" << endl;
    else
        cout << "число не є щасливим :(" << endl;
}

// ----------------------------------------------------------------------- 2: оберт цифр у чотиризначному числі --------------------------------------------------------------------------------- //
void swapDigits() {
    int num;
    cout << "введіть чотиризначне число: ";
    cin >> num;

    if (num < 1000 || num > 9999) {
        cout << "помилка! введене число не є чотиризначним :(" << endl;
        return;
    }

    int d1 = num / 1000;
    int d2 = (num / 100) % 10;
    int d3 = (num / 10) % 10;
    int d4 = num % 10;

    int newNum = d2 * 1000 + d1 * 100 + d4 * 10 + d3;
    cout << "нове число: " << newNum << endl;
}

// -------------------------------------------------------------------------- 3:  максимальний намбер з 7 чисел ---------------------------------------------------------------------------------- //
void maxOfSeven() {
    int maxNum, num;
    cout << "введіть 7 чисел: ";
    cin >> maxNum;

    for (int i = 1; i < 7; i++) {
        cin >> num;
        if (num > maxNum) maxNum = num;
    }
    cout << "максимальне число: " << maxNum << endl;
}

// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- //
int main() {
    setlocale(LC_ALL, "");


    int choice;
    do {
        cout << "\nвиберіть завдання:\n1 - щасливе число\n2 - обмін цифр\n3 - максимум з 7 чисел\n0 - вихід\nВаш вибір: ";
        cin >> choice;
        switch (choice) {
        case 1:
            luckyNum();
            break;
        case 2:
            swapDigits();
            break;
        case 3:
            maxOfSeven();
            break;
        case 0: cout << "Вихід..." << endl;
            break;
        default: cout << "Невірний вибір, спробуйте ще раз." << endl;
        }
    } while (choice != 0);
    return 0;
}






