#include <iostream>
#include <cmath>

using namespace std;

// ----------------------------------------------------------------------------------------------------------------------- 1: Обчислення еквівалентного опору --------- //
void task1() {
    double R1, R2, R3, R0;
    cout << "введіть R1, R2, R3:\n ";
    cin >> R1 >> R2 >> R3;
    R0 = 1 / ((1 / R1) + (1 / R2) + (1 / R3));
    cout << "еквівалентний опір R0 = " << R0 << endl;
}

// --------------------------------------------------------------------------------------------------------------------------------------------- 2: площа кола --------- //
void task2() {
    const double pi = 3.14;
    double L, R, S;
    cout << "введіть довжину кола L:\n ";
    cin >> L;
    R = L / (2 * pi);
    S = pi * R * R;
    cout << "площа кола S = " << S << endl;
}

// -------------------------------------------------------------------------------------------------------------------------- 3: Обчислення пройденої відстані --------- //
void task3() {
    double v, t, a, S;
    cout << "введіть швидкість v, час t та прискорення a:\n ";
    cin >> v >> t >> a;
    S = v * t + (a * t * t) / 2;
    cout << "пройдена відстань S = " << S << endl;
}


// ---------------------------------------------------------------------------------------------------------------------------------------------------------------------- //
int main() {
    setlocale(LC_ALL, "");


    int choice;
    do {
        cout << "\nоберіть завдання або 0 для виходу:\n ";
        cin >> choice;
        switch (choice) {
        case 1:
            task1();
            break;
        case 2:
            task2();
            break;
        case 3:
            task3();
            break;
        case 0:
            cout << "вихід з програми." << endl;
            break;
        default: cout << "невірний вибір. спробуйте ще раз." << endl;
        }
    } while (choice != 0);
    return 0;
}
